Repository: mohsinalimat/Kiosk-1
Catalog: Kiosk/*.lproj/Localizable.strings
Languages: ar

source: اللغة العربية
ar: English

source: Check status of
ar: تحقق من حالة

source: Medical Insurance and Approvals
ar: التأمين الطبي و الموافقات

source: OR
ar: أو

source: Enter Insurance Card
ar: أدخل بطاقة التأمين

source: Press to Scan QR
ar: اضغط على مسح QR

source: Select your Health Insurance
ar: حدد شركة التأمين الصحي الخاصة بك

source: Back
ar: خلف

source: Touch here to type
ar: المس هنا للكتابة

source: Provide the information given on your Health Insurance Card
ar: تقديم المعلومات الواردة على بطاقة التأمين الصحي الخاصة بك

source: Cancel
ar: إلغاء

source: Check Details
ar: تحقق من التفاصيل

source: Change
ar: تغيير الشركة

source: Your given infomration
ar: المعلومات الخاصة بك

source: Requesting . . .
ar: طلب . . .

source: STATUS
ar: الحالة

source: APPROVAL
ar: موافقة

source: Print
ar: طباعة

source: Bring QR code infront of screen
ar: ضع رمز (QR) أمام الشاشة

source: Transaction time up!
ar: وقت الصفقة حتى!

source: Do you want more time?
ar: هل تريد المزيد من الوقت؟

source: Yes
ar: نعم

source: No
ar: لا
